In [2]:
import pandas as pd

### Pandas Change Column Names

Let's change the names of our DataFrame's columns. We will run through 3 methods

1. Method 1 - change column names via .rename()
2. Method 1 - change column names via .rename() using function mapper
3. Method 2 - change column names via .columns()
4. Method 3 - change column names via set_axis()

In [3]:
df = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

### 1. Method 1 - change column names via .rename()

The most straight forward and explicit way to change your column names is via .rename(). I like this method the most because you can easily change one, or all of your column names via a dict.

Here I'm going to change the column name 'AvgBill' to 'Bill'. You need ot tell pandas that you want to change your *columns* so you'll need to specify axis=1 *or* columns=your_mapper. I marginally prefer setting 'columns=' because I don't need to remember if columns is axis=1 or 0.

A mapper is a fancy word for 'What do you want to convert your old values into?'

In [8]:
df.rename({'AvgBill' : 'Bill'}, axis=1)

             name        type   Bill
0  Foreign Cinema  Restaurant  289.0
1       Liho Liho  Restaurant  224.0
2        500 Club         bar   80.5
3      The Square         bar   25.3

In [9]:
df.rename(columns={'AvgBill' : 'Bill'})

             name        type   Bill
0  Foreign Cinema  Restaurant  289.0
1       Liho Liho  Restaurant  224.0
2        500 Club         bar   80.5
3      The Square         bar   25.3

### 2. Method 1 - change column names via .rename() using function mapper

Another beautiful thing you can do with rename is pass a function as a mapper. Pandas will apply the function to the column names.

In this case I'm going to upper each of my column names.

Then I'm going to remove the first letter from each of my column names.

In [15]:
df.rename(columns=str.upper)

             NAME        TYPE  AVGBILL
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [16]:
df.rename(columns=lambda x: x[1:])

              ame         ype  vgBill
0  Foreign Cinema  Restaurant   289.0
1       Liho Liho  Restaurant   224.0
2        500 Club         bar    80.5
3      The Square         bar    25.3

### 3. Method 2 - change column names via .columns()
The next way to change your column names is by setting them all specifically via a list. This is slightly more verbose because you need to outline *all* of your column names, not just the ones you want to change.

Also, you're at a higher risk of mislabeling column names if you accidentally get your orders confused. Be careful with this one.

In [19]:
df.columns = ['Name', 'type', 'ABill']
df

             Name        type  ABill
0  Foreign Cinema  Restaurant  289.0
1       Liho Liho  Restaurant  224.0
2        500 Club         bar   80.5
3      The Square         bar   25.3

In [20]:
df.columns = ['Bill', 'name', 'type']
df

             Bill        name   type
0  Foreign Cinema  Restaurant  289.0
1       Liho Liho  Restaurant  224.0
2        500 Club         bar   80.5
3      The Square         bar   25.3

### 4. Method 3 - change column names via set_axis()

Lastly, you could also change your column names by setting your axis. This last method is great, but doesn't have many advantages (if any) over the first two.

In [21]:
df.set_axis(["Name", "Type", "AvgBill"], axis=1)

             Name        Type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [22]:
df.set_axis(["Name", "Type", "Bills"], axis=1)

             Name        Type  Bills
0  Foreign Cinema  Restaurant  289.0
1       Liho Liho  Restaurant  224.0
2        500 Club         bar   80.5
3      The Square         bar   25.3